["```py\n{\"requester\":\"John\"} \n```", "```py\n    gsutil mb gs://<bucket name>\n    gsutil mb gs://muasif-testcloudfn    #Example bucket   created\n    ```", "```py\n    gsutil versioning set off gs://muasif-testcloudfn\n    ```", "```py\n    python -m venv myenv\n    source myenv/bin/activate\n    ```", "```py\n    pip install sendgrid\n    ```", "```py\n    pip freeze -> requirements.txt\n    ```", "```py\n    #handle_storage_event function is expected to receive event and context objects as input arguments. An event object is a dictionary that contains the data of the event. We can access the event data from this object using keys such as bucket (that is, the bucket name), name (that is, the filename), and timeCreated (that is, the creation time). The context object provides the context of the event such as event_id and event_type. Additionally, we use the sendgrid library to prepare the email contents and then send the email with the event information to the target email list.\n    ```", "```py\n    gcloud functions deploy handle_storage_create, and the entry-point attribute is set to the handle_storage_event function in the Python code. We set trigger-event to the finalize event. By using set-env-vars, we set SENDGRID_API_KEY for the SendGrid service.The `deploy` command will package the Python code from the current directory, prepare the target platform as per the `requirements.txt` file, and then deploy our Python code to the GCP Cloud Functions platform. In our case, we can create a `.gcloudignore` file to exclude the files and directories so that they can be ignored by the Cloud SDK `deploy` command.\n    ```", "```py\n    gsutil finalize event will trigger the execution of our Cloud Function. As a result, we will receive an email with the event details. We can also check the logs of the Cloud Functions by using the following command:\n\n    ```", "```py\n\n    ```", "```py\ngcloud functions deploy handle_storage_delete \\\n--entry-point handle_storage_event --runtime python38 \\\n--trigger-resource gs://muasif-testcloudfn/ \\\n--trigger-event google.storage.object.delete\n--set-env-vars SENDGRID_API_KEY=<Your SEND-GRID KEY>\n```", "```py\ngsutil rm gs://muasif-testcloudfn/test1.txt\n```"]